export default {
  // 存储全局变量
  token: null, // 登录的token
  userInfo: {}, // 登录的用户信息
  cacheData: {}, // 用户各页面数据缓存
  userPermission: null, // 当前登录用户所拥有的权限
  // 路由映射，为了让路由变化时，前端首页的头部显示相应的名称
  routerName: {
    'home': '柳州市妇幼保健院',
  },
  // 面包屑显示配置项
  breadCrumbsConfig: {
    '/fidIdMaintain_P2': [{
      name: '信息管理'
    }, {
      path: '/fidIdMaintain_P2',
      name: '字段管理'
    }],
  },
  // 后台字段管理（key）值匹配（中文转 id）
  keysMap: {
    '医务科管理': 1,
    '党办管理': 2,
    '纪检监察室': 3,
    '科教科': 4,
    '人民调解办': 5,
    '医师资格管理': 6,
    '医师会诊信息': 7,
    '锦旗登记': 8,
    '退红包登记': 9,
    '论文登记': 10,
    '专利登记': 11,
    '课题立项': 12,
    '投诉统计': 13,
    '产前筛选证': 14,
    '母婴保健技术合格证（产前诊断）': 15,
    '婚前医学检查证': 16,
    '母婴保健技术合格证（孕产期保健技术、结扎终止妊娠）': 17,
    '请院外会诊': 18,
    '医师外出会诊': 19,
    '院内多学科会诊（邀请会诊科室）': 20,
    '院内多学科会诊（参与会诊科室）': 21,
    '院内多学科会诊': 22,
    '纠纷统计': 23,
  },
  // 权限 id 值匹配表 (权限名称对应的 id)
  permissionNameMapID: {
    '医德医风门户前端权限': 1,
  },
  permissionIDMapName: {
    1: '医德医风门户前端权限',
  },
}
